tests/fixtures/rectificativa.xml

<?xml version="1.0" encoding="UTF-8"?>
<fe:Facturae xmlns:fe="http://www.facturae.gob.es/formato/Versiones/Facturaev3_2_2">
  <FileHeader>
    <SchemaVersion>3.2.2</SchemaVersion>
    <Modality>I</Modality>
    <InvoiceIssuerType>EM</InvoiceIssuerType>
    <Batch>
      <BatchIdentifier>A12345678202401R01</BatchIdentifier>
      <InvoicesCount>1</InvoicesCount>
      <TotalInvoicesAmount>
        <TotalAmount>-60.50</TotalAmount>
      </TotalInvoicesAmount>
      <TotalOutstandingAmount>
        <TotalAmount>-60.50</TotalAmount>
      </TotalOutstandingAmount>
      <TotalExecutableAmount>
        <TotalAmount>-60.50</TotalAmount>
      </TotalExecutableAmount>
      <InvoiceCurrencyCode>EUR</InvoiceCurrencyCode>
    </Batch>
  </FileHeader>
  <Parties>
    <SellerParty>
      <TaxIdentification>
        <PersonTypeCode>J</PersonTypeCode>
        <ResidenceTypeCode>R</ResidenceTypeCode>
        <TaxIdentificationNumber>A12345678</TaxIdentificationNumber>
      </TaxIdentification>
      <LegalEntity>
        <CorporateName>Empresa Ejemplo S.L.</CorporateName>
        <AddressInSpain>
          <Address>Calle Mayor 123</Address>
          <PostCode>28001</PostCode>
          <Town>Madrid</Town>
          <Province>Madrid</Province>
          <CountryCode>ESP</CountryCode>
        </AddressInSpain>
      </LegalEntity>
    </SellerParty>
    <BuyerParty>
      <TaxIdentification>
        <PersonTypeCode>J</PersonTypeCode>
        <ResidenceTypeCode>R</ResidenceTypeCode>
        <TaxIdentificationNumber>B87654321</TaxIdentificationNumber>
      </TaxIdentification>
      <LegalEntity>
        <CorporateName>Cliente Ejemplo S.A.</CorporateName>
        <AddressInSpain>
          <Address>Avenida Principal 456</Address>
          <PostCode>08001</PostCode>
          <Town>Barcelona</Town>
          <Province>Barcelona</Province>
          <CountryCode>ESP</CountryCode>
        </AddressInSpain>
      </LegalEntity>
    </BuyerParty>
  </Parties>
  <Invoices>
    <Invoice>
      <InvoiceHeader>
        <InvoiceNumber>2024/R01</InvoiceNumber>
        <InvoiceSeriesCode>R</InvoiceSeriesCode>
        <InvoiceDocumentType>FC</InvoiceDocumentType>
        <InvoiceClass>OR</InvoiceClass>
        <Corrective>
          <InvoiceNumber>2024/001</InvoiceNumber>
          <InvoiceSeriesCode>A</InvoiceSeriesCode>
          <ReasonCode>01</ReasonCode>
          <ReasonDescription>Número de factura incorrecto</ReasonDescription>
          <TaxPeriod>
            <StartDate>2024-01-01</StartDate>
            <EndDate>2024-01-31</EndDate>
          </TaxPeriod>
          <CorrectionMethod>01</CorrectionMethod>
          <CorrectionMethodDescription>Rectificación íntegra</CorrectionMethodDescription>
        </Corrective>
      </InvoiceHeader>
      <InvoiceIssueData>
        <IssueDate>2024-01-30</IssueDate>
        <InvoiceCurrencyCode>EUR</InvoiceCurrencyCode>
        <TaxCurrencyCode>EUR</TaxCurrencyCode>
        <LanguageName>es</LanguageName>
      </InvoiceIssueData>
      <TaxesOutputs>
        <Tax>
          <TaxTypeCode>01</TaxTypeCode>
          <TaxRate>21.00</TaxRate>
          <TaxableBase>
            <TotalAmount>-50.00</TotalAmount>
          </TaxableBase>
          <TaxAmount>
            <TotalAmount>-10.50</TotalAmount>
          </TaxAmount>
        </Tax>
      </TaxesOutputs>
      <InvoiceTotals>
        <TotalGrossAmount>-50.00</TotalGrossAmount>
        <TotalGeneralDiscounts>0.00</TotalGeneralDiscounts>
        <TotalGeneralSurcharges>0.00</TotalGeneralSurcharges>
        <TotalGrossAmountBeforeTaxes>-50.00</TotalGrossAmountBeforeTaxes>
        <TotalTaxOutputs>-10.50</TotalTaxOutputs>
        <TotalTaxesWithheld>0.00</TotalTaxesWithheld>
        <InvoiceTotal>-60.50</InvoiceTotal>
        <TotalOutstandingAmount>-60.50</TotalOutstandingAmount>
        <TotalExecutableAmount>-60.50</TotalExecutableAmount>
      </InvoiceTotals>
      <Items>
        <InvoiceLine>
          <ItemDescription>Anulación servicio - Error de facturación</ItemDescription>
          <Quantity>-1.00</Quantity>
          <UnitOfMeasure>01</UnitOfMeasure>
          <UnitPriceWithoutTax>50.00</UnitPriceWithoutTax>
          <TotalCost>-50.00</TotalCost>
          <GrossAmount>-50.00</GrossAmount>
          <TaxesOutputs>
            <Tax>
              <TaxTypeCode>01</TaxTypeCode>
              <TaxRate>21.00</TaxRate>
              <TaxableBase>
                <TotalAmount>-50.00</TotalAmount>
              </TaxableBase>
              <TaxAmount>
                <TotalAmount>-10.50</TotalAmount>
              </TaxAmount>
            </Tax>
          </TaxesOutputs>
        </InvoiceLine>
      </Items>
    </Invoice>
  </Invoices>
</fe:Facturae>
